#include <iostream>
using namespace std;

int main()
{
	// สร้างตัวแปรที่ใช้เก็บเลขจำนวนเต็ม a โดยกำหนดให้มีค่าเท่ากับ 5
    int a = 5;
    // สร้างตัวแปรที่ใช้เก็บตัวอักษร b โดยกำหนดให้มีค่าเท่ากับตัวอักษร A
	char b = 'A';

    // ประการตัวแปรประเภท Reference c ให้ Reference ไปที่ตัวแปร b
	char &c = b;
    // สร้างตัวแปรประเภท Pointer x ให้ชี้ไปที่ตัวแปร a
	int *x = &a;
    // สร้างตัวแปรประเภท Pointer y ให้ชี้ไปที่ตัวแปร b 
	char *y = &b;
    // สร้างตัวแปรประเภท Pointer z ให้ขี้ไปที่ตัวแปร x
	int **z = &x;

    // แสดงค่าของตัวแปร a, b, c, x, y และ z โดยมีช่องว่างระหว่างแต่ละค่า เมื่อพิมพ์ครบ 6 ค่าแล้วให้ขึ้นบรรทัดใหม่
	cout << a << " " << b << " " << c << " " << &x << " " << &y << " " << &z << endl;
    // แสดงค่า Address ของตัวแปร a, b, c, x, y และ z โดยมีช่องว่างระหว่างแต่ละค่า เมื่อพิมพ์ครบ 6 ค่าแล้วให้ขึ้นบรรทัดใหม่
	cout << &a << " " << (void *)&b << " " << (void *)&b << " " << &x << " " << &y << " " << &z << endl;

    // เปลี่ยนค่าของตัวแปร b ให้เป็นตัวอักษร F โดยการกำหนดผ่านตัวแปร c
	c = 'F';
    // แสดงค่าของตัวแปร a, b, c, x, y และ z โดยมีช่องว่างระหว่างแต่ละค่า เมื่อพิมพ์ครบ 6 ค่าแล้วให้ขึ้นบรรทัดใหม่
	cout << a << " " << b << " " << c << " " << &x << " " << &y << " " << &z << endl;

    // เปลี่ยนค่าของตัวแปร b ให้เป็นตัวอักษร W โดยการกำหนดผ่าน Pointer y
	*y = 'W';
    // แสดงค่าของตัวแปร a, b, c, x, y และ z โดยมีช่องว่างระหว่างแต่ละค่า เมื่อพิมพ์ครบ 6 ค่าแล้วให้ขึ้นบรรทัดใหม่
	cout << a << " " << b << " " << c << " " << &x << " " << &y << " " << &z << endl;

    // เปลี่ยนค่าของตัวแปร a ให้เป็น 6 โดยการกำหนดผ่าน Pointer x
	*x = 6;
    // แสดงค่าของตัวแปร a, b, c, x, y และ z โดยมีช่องว่างระหว่างแต่ละค่า เมื่อพิมพ์ครบ 6 ค่าแล้วให้ขึ้นบรรทัดใหม่
	cout << a << " " << b << " " << c << " " << &x << " " << &y << " " << &z << endl;

    // เปลี่ยนค่าของตัวแปร a ให้เป็น 7 โดยการกำหนดผ่าน Pointer z
	**z = 7;
    // แสดงค่าของตัวแปร a, b, c, x, y และ z โดยมีช่องว่างระหว่างแต่ละค่า เมื่อพิมพ์ครบ 6 ค่าแล้วให้ขึ้นบรรทัดใหม่
	cout << a << " " << b << " " << c << " " << &x << " " << &y << " " << &z;

	return 0;
}